// --------------------------------------------------------------------
// let arr = ['🍔','🌯', '🍣', '🍕', '🍜', '🍱', '🍙', '🍘', '🥩'];
// arr.fill('🍺', 4  );
// arr.forEach(item => {console.log(item);})

// --------------------------------------------------------------------

// let arr2 = ['🍕','🍕', '🍍', '🍕', '🍕'];
// arr2.find(item => 
//     { if (item == '🍍'){
//         console.log('🍍');

//     }

// });

// --------------------------------------------------------------------

// let arr3 = ['🍕','🍕', '🍍', '🍕', '🍕'];

//     arr3.splice(2, 1);

//     arr3.forEach(item => { console.log(item);

//     });

// --------------------------------------------------------------------

// let arr4 = ['🍓', '🍋', '🍓', '🍋', '🍓'];


// for (let i = 0; i < arr4.length; i++) {

//     if(arr4[i] === '🍓'){

//         arr4.splice(i, 1, '🍄');

//     }

//     }
// console.log(arr4);

// --------------------------------------------------------------------

// let arr5 = ['🌶️', '🥛', '🌶️', '🥛', '🌶️', '🥛'];

// for (let i = 0; i < arr5.length; i++) {
//     console.log(i);
//     if (arr5[i] === '🌶️') {
//         console.log(i);
//         arr5.splice(i, 1, '🌶️','🥵');
//         console.log(arr5);
//     }
// }
// console.log(arr5);



let arr6 = ['🌅', '🌅', '🌅', '🃏', '🌅', '🌅', '🌅'];
console.log(arr6);
 arr6.splice(3, 1,)
 console.log(arr6);

 for (let i = 0; i < arr6.length; i++) {
    //  console.log(i);
     if (arr6[i] === '🌅') {
        //  console.log(i);
   arr6.splice(i, 1, '🌅','🃏');
          
        //  console.log(arr6);
        //  arr6.forEach(i => { console.log(i)});
     }
    }
     console.log(arr6);



